{
  "hdm_logo_font_size": {
    "line1": "1.32em",
    "line2": "1.45em"
  },

  "find_out": "erfahren Sie",
  "more": "mehr",
  "about": "über",
  "my_works": "meine Arbeit",

  "navbar": {
    "home": "Home",
    "about_me": "Über mich",
    "my_works": "Projekte"
  },

  "homepage": {
    "he": "ha",
    "llo": "llo",
    "iam": ", ich bin",
    "software_developer": "Software Entwickler",
    "discover": "Entdecken Sie",
    "more_about": "Mehr über",
    "my_persona": "mich",
    "my_works": "meine Arbeit"
  },
  "about_me": {
    "full_stack_dev": "Full Stack Entwickler",
    "based_in": "Ansässig in",
    "city": "Stuttgart",
    "country": "Deutschland",
    "personal_info": "Persönliche Angaben",
    "full_name": "Vor- und Nachname",
    "birth": "Geboren",
    "birth_date_place": "19.03.1998 in Canicattì, Italien",
    "student_at": "Student an der",
    "hdm_line1": "HOCHSCHULE",
    "hdm_line2": "DER MEDIEN",
    "target_degree": "Angestrebter Abschluss",
    "study_course": "Wirtschaftsinformatik und Digitale Medien",
    "bachelor": "Bachelor of Science",
    "finished_approximately": "voraussichtlich abgeschlossen",
    "edu_background": "Akademischer Hintergrund",
    "expertise": "Expertise",
    "mob_app_dev": "Entwicklung für Mobile Geräte",
    "web_dev": "Web-Entwicklung",
    "projects": "Projekte",
    "languages": "Sprachen",
    "contact": "Kontakt",
    "send_mail": "Email Senden",
    "my_story_label": "Meine Geschichte",
    "story": "Ich wurde 1998 in Italien geboren, in einer Stadt namens Canicattì in Sizilien. Im Alter von 8 Jahren kaufte mein Vater unseren ersten Personal Computer, einen Windows-Computer. Damals lief darauf Windows XP, und ich erinnere mich, dass ich mich sofort in den Computer verliebt habe; es gab so viele Möglichkeiten. Als ich älter wurde und sich die Technologie weiterentwickelte, begann ich das Potenzial dieser Maschinen zu erkennen; es gab so viel, was man damit machen konnte. Im Alter von 9 Jahren zogen meine Eltern, meine Tante und ich aus beruflichen Gründen nach Spanien, nach Valencia. Fernab von meinen Freunden und meiner Familie fiel es mir als Kind schwer, eine neue Sprache zu lernen und mich an die neue Umgebung anzupassen. Aber kurz darauf beschlossen meine Eltern aus denselben Gründen, nach Deutschland zu ziehen, wo ich jetzt lebe. Also musste ich wieder von vorne anfangen: eine neue Sprache lernen, neue Freunde finden, mich an eine neue und viel andersartige Umgebung anpassen. In der Zwischenzeit habe ich auch angefangen, Englisch zu lernen: meistens über meinen Computer oder über Videospiele. Ich kann mich glücklich schätzen, dass ich Sprachen mag und keine allzu großen Schwierigkeiten habe, neue zu lernen. Auch wenn mir die zwei Umzüge in so kurzer Zeit eine schwere Zeit in meiner Kindheit beschert haben, kann ich heute mit Sicherheit sagen, dass ich ohne diese Umzüge nicht die gleiche Person wäre wie heute. Die Erfahrungen, die ich gemacht habe, die kulturellen Unterschiede, die neuen Sprachen, die ich gelernt habe - sie alle haben eine große Rolle dabei gespielt, mich zu einem aufgeschlosseneren und reiferen Menschen zu machen. Warum habe ich mich für den Beruf des Entwicklers entschieden? Sicherlich nicht nur, weil ich den Computer sehr mochte. Schon lange bevor ich mein erstes \"Hello World\"-Programm schrieb, hatte ich das Gefühl, dass Menschen, die diese Dinge tun können, die Kontrolle über die Geräte haben, die wie Plugins für unser biologisches Selbst sind. Es mag albern klingen, aber heutzutage kann man ohne ein Smartphone in der Tasche kaum noch die Hälfte der Dinge tun, die man im Alltag tut. Also wollte ich diese Art von Kontrolle haben und begann, immer mehr Dinge mit meinen Geräten zu machen, bis zu dem Punkt, an dem man mich als den Techniker bezeichnen könnte, den alle anrufen, wenn sie Hilfe mit ihren Geräten brauchen. Nachdem ich in der Schule meine ersten Codezeilen geschrieben hatte, beschloss ich schließlich, Informatik zu studieren."
  },
  "works":{
    "fetching_repos": "Repositories laden..."
  },
  "work": {
    "fetching_repo": "Repository lädt...",
    "project_id": "Projekt ID",
    "creation_date": "Erstellungsdatum",
    "visit_the": "Besuchen Sie die",
    "repository": "Repository",
    "for_more": "für mehr",
    "made_with": "Entwickelt mit",
    "desc_label": "Beschreibung",
    "work_desc": {

    },
    "creators_comment_label": "Kommentar des Entwicklers",
    "creators_comment": {
      "flash": "Flash is my biggest and latest Project (as for now: 10.01.2023). I've learned a lot more from this one than any previously done Project. We used Vue.js for the Front-End and Django for the Back-End. I was predominantly focused on the Front-End and thereby I learned how to use Frameworks in general work and, of course, specifically Vue.js. I liked the Framework a lot, so I decided to my build my Portfolio-Website with it",
      "locawiki": "This was my first attempt at creating a Mobile App and the first time working with Android Studio. I didn't have much trouble since it's based on Jetbrains' IDEs and I've had already worked with IntelliJ and WebStorm before. It's nothing more than what Google is able to do, but hey, it works as intended.",
      "momhunt": "I got the idea while being on the phone with my mom. This was my first approach to Unity and I could learn the basics of the Unity Environment as well as the C Sharp Programming Language. I also found out that I don't enjoy developing games as much as I enjoy doing the same with Mobile and Web Apps. Still, I liked the idea and hey, I now have a self-coded game that I can play. :)",
      "weather_forecast": "This was my first Software Development Project I made at my University. I already knew Java, so my partner and I decided to choose this Project as we considered it to be the most difficult one. I could learn the basics of API implementations and other Java stuff that will be useful to me in the future."
    }
  }
}