{
  "hdm_logo_font_size": {
    "line1": "1.32em",
    "line2": "1.45em"
  },

  "find_out": "erfahren Sie",
  "more": "mehr",
  "about": "über",
  "my_works": "meine Arbeit",

  "navbar": {
    "home": "Home",
    "about_me": "Über mich",
    "my_works": "Projekte"
  },

  "homepage": {
    "he": "ha",
    "llo": "llo",
    "iam": ", ich bin",
    "software_developer": "Software Entwickler",
    "discover": "Entdecken Sie",
    "more_about": "Mehr über",
    "my_persona": "mich",
    "my_works": "meine Arbeit"
  },
  "about_me": {
    "full_stack_dev": "Full Stack Entwickler",
    "based_in": "Ansässig in",
    "city": "Stuttgart",
    "country": "Deutschland",
    "personal_info": "Persönliche Angaben",
    "full_name": "Vor- und Nachname",
    "birth": "Geboren",
    "birth_date_place": "19.03.1998 in Canicattì, Italien",
    "student_at": "Student an der",
    "hdm_line1": "HOCHSCHULE",
    "hdm_line2": "DER MEDIEN",
    "target_degree": "Angestrebter Abschluss",
    "study_course": "Wirtschaftsinformatik und Digitale Medien",
    "bachelor": "Bachelor of Science",
    "finished_approximately": "voraussichtlich abgeschlossen",
    "edu_background": "Akademischer Hintergrund",
    "expertise": "Expertise",
    "mob_app_dev": "Entwicklung für Mobile Geräte",
    "web_dev": "Web-Entwicklung",
    "projects": "Projekte",
    "languages": "Sprachen",
    "contact": "Kontakt",
    "send_mail": "Email Senden",
    "my_story_label": "Meine Geschichte",
    "story": "Ich wurde 1998 in Italien geboren, in einer Stadt namens Canicattì in Sizilien. Im Alter von 8 Jahren kaufte mein Vater unseren ersten Personal Computer, einen Windows-Computer. Damals lief darauf Windows XP, und ich erinnere mich, dass ich mich sofort in den Computer verliebt habe; es gab so viele Möglichkeiten. Als ich älter wurde und sich die Technologie weiterentwickelte, begann ich das Potenzial dieser Maschinen zu erkennen; es gab so viel, was man damit machen konnte. Im Alter von 9 Jahren zogen meine Eltern, meine Tante und ich aus beruflichen Gründen nach Spanien, nach Valencia. Fernab von meinen Freunden und meiner Familie fiel es mir als Kind schwer, eine neue Sprache zu lernen und mich an die neue Umgebung anzupassen. Aber kurz darauf beschlossen meine Eltern aus denselben Gründen, nach Deutschland zu ziehen, wo ich jetzt lebe. Also musste ich wieder von vorne anfangen: eine neue Sprache lernen, neue Freunde finden, mich an eine neue und viel andersartige Umgebung anpassen. In der Zwischenzeit habe ich auch angefangen, Englisch zu lernen: meistens über meinen Computer oder über Videospiele. Ich kann mich glücklich schätzen, dass ich Sprachen mag und keine allzu großen Schwierigkeiten habe, neue zu lernen. Auch wenn mir die zwei Umzüge in so kurzer Zeit eine schwere Zeit in meiner Kindheit beschert haben, kann ich heute mit Sicherheit sagen, dass ich ohne diese Umzüge nicht die gleiche Person wäre wie heute. Die Erfahrungen, die ich gemacht habe, die kulturellen Unterschiede, die neuen Sprachen, die ich gelernt habe - sie alle haben eine große Rolle dabei gespielt, mich zu einem aufgeschlosseneren und reiferen Menschen zu machen. Warum habe ich mich für den Beruf des Entwicklers entschieden? Sicherlich nicht nur, weil ich den Computer sehr mochte. Schon lange bevor ich mein erstes \"Hello World\"-Programm schrieb, hatte ich das Gefühl, dass Menschen, die diese Dinge tun können, die Kontrolle über die Geräte haben, die wie Plugins für unser biologisches Selbst sind. Es mag albern klingen, aber heutzutage kann man ohne ein Smartphone in der Tasche kaum noch die Hälfte der Dinge tun, die man im Alltag tut. Also wollte ich diese Art von Kontrolle haben und begann, immer mehr Dinge mit meinen Geräten zu machen, bis zu dem Punkt, an dem man mich als den Techniker bezeichnen könnte, den alle anrufen, wenn sie Hilfe mit ihren Geräten brauchen. Nachdem ich in der Schule meine ersten Codezeilen geschrieben hatte, beschloss ich schließlich, Informatik zu studieren."
  },
  "works":{
    "fetching_repos": "Repositories laden..."
  },
  "work": {
    "fetching_repo": "Repository lädt...",
    "project_id": "Projekt ID",
    "creation_date": "Erstellungsdatum",
    "visit_the": "Besuchen Sie die",
    "repository": "Repository",
    "for_more": "für mehr",
    "made_with": "Entwickelt mit",
    "desc_label": "Beschreibung",
    "work_desc": {

    },
    "creators_comment_label": "Kommentar des Entwicklers",
    "creators_comment": {
      "flash": "Flash ist mein größtes und neuestes Projekt (Stand: 10.01.2023). Ich habe aus diesem Projekt viel mehr gelernt als aus allen zuvor durchgeführten Projekten. Wir haben Vue.js für das Front-End und Django für das Back-End verwendet. Ich habe mich hauptsächlich auf das Front-End konzentriert und dadurch gelernt, wie man Frameworks im Allgemeinen einsetzt und natürlich speziell Vue.js. Mir hat das Framework sehr gut gefallen, deshalb habe ich beschlossen, meine Portfolio-Website damit zu erstellen.",
      "locawiki": "Dies war mein erster Versuch, eine mobile App zu erstellen, und die erste Erfahrung mit Android Studio. Ich hatte keine großen Probleme, da es auf den IDEs von JetBrains basiert und ich bereits zuvor mit IntelliJ und WebStorm gearbeitet hatte. Es ist nichts mehr als das, was Google tun kann, aber hey, es funktioniert wie beabsichtigt.",
      "momhunt": "Ich hatte die Idee, als ich mit meiner Mutter telefonierte. Das war mein erster Versuch mit Unity, und ich konnte die Grundlagen der Unity-Umgebung sowie der Programmiersprache C Sharp lernen. Ich habe auch festgestellt, dass es mir nicht so viel Spaß macht, Spiele zu entwickeln, wie ich es bei mobilen und Web-Apps genieße. Dennoch mochte ich die Idee, und hey, jetzt habe ich ein selbst programmiertes Spiel, das ich spielen kann. :)",
      "weather_forecast": "Dies war mein erstes Softwareentwicklungsprojekt an meiner Universität. Ich kannte bereits Java, daher haben mein Partner und ich uns entschieden, dieses Projekt auszuwählen, da wir es als das schwierigste betrachteten. Ich konnte die Grundlagen der API-Implementierung und anderer Java-Themen lernen, die mir in der Zukunft nützlich sein werden."
    }

  }
}